<?php

declare(strict_types=1);

return [
    'failed'   => 'Неверное имя пользователя или пароль.',
    'password' => 'Некорректный пароль.',
    'throttle' => 'Слишком много попыток входа. Пожалуйста, попробуйте ещё раз через :seconds секунд.',
    'email_verified' => 'Адрес электронной почты успешно подтверждён.',

    'modal' => [
        'sign_in' => 'Вход',
        'registration' => 'Регистрация',
        'email' => 'Электронная почта',
        'password' => 'Пароль',
        'new_password' => 'Новый пароль',
        'remember' => 'Запомнить меня',
        'sign_in_button' => 'Войти',
        'forgot' => 'Забыли пароль?',
        'name' => 'Имя',
        'confirm_password' => 'Подтверждение пароля',
        'register' => 'Зарегистрироваться',
        'back' => 'Назад',
        'forgot_note' => 'Пожалуйста, укажите адрес своей электронной почты и мы отправим Вам ссылку для сброса пароля.',
        'forgot_send' => 'Отправить ссылку',
        'registration_success' => [
            'welcome' => 'Добро пожаловать, :name!',
            'link_sent' => 'На адрес :address была отправлена ссылка для подтверждения данного адреса электронной почты.',
        ],
        'password_reset' => [
            'title' => 'Сброс пароля',
            'submit_btn' => 'Сохранить',
        ],
    ],
];
