<?php

return [
    'product_comparison' => 'Сравнение товаров',
    'compare' => 'Сравнить',
    'in_list' => 'В списке сравнения',
    'remove' => 'Удалить',
    'remove_title' => 'Удалить из списка',
    'clear' => 'Очистить',
    'clear_list' => 'Очистить список',
    'empty' => 'Список товаров пуст',

    'modal' => [
        'another_category' => 'Вы добавляете товар из другой категории. Если продолжить, текущий список сравнения будет очищен.',
        'proceed' => 'Продолжить',
    ],
];
