<?php

declare(strict_types=1);

return [
    'greeting' => 'Здравствуйте, :name!',
    'signature1' => 'С уважением,',
    'signature2' => 'команда Магазина электроники',
    'footer' => 'Вы получили это письмо, так как Вами был сделан заказ на сайте :link. Если это были не Вы, пожалуйста, игнорируйте это письмо, или свяжитесь с нами.',
    'copyright' => 'Магазин электроники. Все права защищены.',

    'order_sent' => [
        'subject' => 'Заказ :id отправлен.',
        'body' => 'Заказ :id на сумму :total_cost_formatted отправлен службой доставки по указанному вами адресу. Просматривать информацию о Ваших заказах и отслеживать их статус вы можете в разделе :orders_link.',
    ],
];
