<?php

declare(strict_types=1);

return [
    'back_to_product' => 'На страницу товара',
    'reviews_num' => ':count отзыв|:count отзыва|:count отзывов',
    'term_of_use' => 'Срок использования',
    'term' => [
        'days' => 'несколько дней',
        'weeks' => 'несколько недель',
        'months' => 'несколько месяцев',
        'years' => 'несколько лет',
    ],
    'pros' => 'Достоинства',
    'cons' => 'Недостатки',
    'comment' => 'Комментарий',
    'form' => [
        'title' => 'Оставить отзыв',
        'term' => 'Срок использования',
        'optional' => 'Не обязательно для заполнения',
        'send' => 'Отправить',
    ],
    'sign_in_to_review' => 'Зарегистрируйтесь или войдите, чтобы оставлять отзывы',
    'please_rate' => 'Пожалуйста, поставьте оценку товару',
    'review_added' => 'Спасибо! Ваш отзыв успешно добавлен.',
];