<?php

return [
    'profile' => 'Настройки профиля',
    'photo_size_note' => 'Размер файла изображения не должен превышать :num Мб.',
    'photo_res_note' => 'Разрешение не должно быть более :num px по любой из сторон.',
    'save' => 'Сохранить',

    'labels' => [
        'photo' => 'Фото',
        'name' => 'Имя',
        'email' => 'Адрес электронной почты',
        'phone' => 'Номер телефона',
        'delivery_address' => 'Адрес для доставки',
        'current_password' => 'Текущий пароль',
        'new_password' => 'Новый пароль',
        'password_confirm' => 'Подтверждение нового пароля',
    ],

    'verification' => [
        'verified' => 'Адрес подтверждён.',
        'not_verified' => 'Адрес не подтверждён! При регистрации на вашу почту была отправлена ссылка для подтверждения, пожалуйста, перейдите по ней.',
        'send_link' => 'Отправить ссылку ещё раз',
        'link_sent' => 'Ссылка отправлена на почту.',
    ],

    'updated' => 'Профиль обновлён.',
];