<?php

return [
    'warranty' => 'Гарантия',

    'defects' => [
        'title' => 'Если в купленном Вами товаре в течение установленного гарантийного срока обнаружены недостатки, Вы по своему выбору вправе',
        'same_brand' => 'потребовать замены на товар этой же марки (этой же модели и (или) артикула)',
        'recalculation' => 'потребовать замены на такой же товар другой марки (модели, артикула) с соответствующим перерасчетом покупной цены',
        'price_reduction' => 'потребовать соразмерного уменьшения покупной цены',
        'fixing' => 'потребовать незамедлительного безвозмездного устранения недостатков товара или возмещения расходов на их исправление потребителем или третьим лицом',
        'refund' => 'отказаться от исполнения договора купли-продажи и потребовать возврата уплаченной за товар суммы. В этом случае Вы обязаны вернуть товар с недостатками продавцу за его счет',
    ],

    'complex' => [
        'title' => 'В отношении технически сложного товара Вы в случае обнаружения в нем недостатков по своему выбору вправе',
        'refund' => 'отказаться от исполнения договора купли-продажи и потребовать возврата уплаченной за такой товар суммы',
        'replacement' => 'предъявить требование о его замене на товар этой же марки (модели, артикула) или на такой же товар другой марки (модели, артикула) с соответствующим перерасчетом покупной цены',
    ],
];
