<?php

return [
    'buttons' => [
        'move' => 'Переместить',
        'delete' => 'Удалить',
    ],

    'products' => [
        'change_category' => 'Вы уверены, что хотите переместить товар в другую категорию? Все характеристики всех SKU данного товара будут удалены!',
        'field_must_be_filled' => 'Это поле должно быть заполнено',
        'delete_attribute' => 'Вы уверены, что хотите удалить атрибут? Все варианты данного атрибута будут удалены у всех SKU!',
        'delete_variant' => 'Вы уверены, что хотите удалить этот вариант у всех SKU данного товара?',
    ],

    'skus' => [
        'spec_updated' => 'Характеристика обновлена',
        'spec_cleared' => 'Характеристика очищена',
    ],
];