<?php

return [
    'buttons' => [
        'move' => 'Переместить',
        'delete' => 'Удалить',
    ],

    'products' => [
        'change_category' => 'Вы уверены, что хотите переместить товар в другую категорию? Все характеристики всех SKU данного товара будут удалены!',
        'field_must_be_filled' => 'Это поле должно быть заполнено',
        'delete_attribute' => 'Вы уверены, что хотите удалить атрибут? Все варианты данного атрибута будут удалены у всех SKU!',
        'delete_variant' => 'Вы уверены, что хотите удалить этот вариант у всех SKU данного товара?',
        'delete_product' => 'Вы уверены, что хотите удалить этот товар? Вместе с ним будут безвозвратно удалены все его SKU вместе с изображениями, характеристиками, отзывами, лайками, позициями в корзинах пользователей и избранном.',
        'delete_sku' => 'Вы уверены, что хотите удалить эту SKU? Вместе с ней будут безвозвратно удалены её характеристики, отзывы, лайки, позиции в корзинах пользователей и избранном.',
    ],

    'categories' => [
        'delete_spec' => 'Вы уверены, что хотите удалить спецификацию ":name"? Значения данной спецификации будут удалены у всех SKU данной категории.',
    ],
];