<?php

return [
    'dashboard' => 'Статистика',
    'month' => 'Месяц',
    'orders_count' => 'Количество заказов',
    'sales_amount' => 'Объём продаж',
    'skus_added' => 'Добавлено новых SKU',
    'users_registered' => 'Зарегистрировано пользователей',
    'reviews_added' => 'Оставлено отзывов или оценок',

    'last_year' => 'Последние 12 месяцев',
    'all_categories' => 'Все категории',
    'reset_filters' => 'Сбросить фильтры',

    'months' => [
        '1' => 'Январь',
        '2' => 'Февраль',
        '3' => 'Март',
        '4' => 'Апрель',
        '5' => 'Май',
        '6' => 'Июнь',
        '7' => 'Июль',
        '8' => 'Август',
        '9' => 'Сентябрь',
        '10' => 'Октябрь',
        '11' => 'Ноябрь',
        '12' => 'Декабрь',
    ]
];
