<?php

return [
    'reviews' => 'Отзывы',
    'editing_review' => 'Редактирование отзыва',
    'delete_review' => 'Удалить этот отзыв',

    'messages' => [
        'review_deleted' => 'Отзыв #:id удалён',
    ],

    'columns' => [
        'id' => 'ID',
        'sku_id' => 'SKU ID',
        'user_id' => 'ID польз.',
        'term' => 'Срок использования',
        'mark' => 'Оценка',
        'pros' => 'Достоинства',
        'cons' => 'Недостатки',
        'comnt' => 'Комментарий',
        'created_at' => 'Дата добавления',
        'updated_at' => 'Дата изменения',
    ],

    'author' => 'Автор',
    'created_at' => 'Дата публикации',
    'term' => 'Срок использования',
    'mark' => 'Оценка товару',
    'likes' => 'Лайков',
    'dislikes' => 'Дизлайков',
    'pros' => 'Достоинства',
    'cons' => 'Недостатки',
    'comnt' => 'Комментарий',

    'delete_review_warning' => 'При удалении отзыва также будут удалены соответствующая оценка товара и все реакции на отзыв.',
];
