<?php

return [
    'settings' => 'Настройки',
    'saved' => 'Настройка сохранена',
    'add' => 'Добавить настройку',
    'added' => 'Настройка добавлена',
    'new' => 'Новая настройка',

    'create_form' => [
        'id' => 'ID настройки',
        'id_note' => 'Допускаются только латинские символы, цифры и нижнее подчёркивание. Пример: "catalog_per_page".',
        'name' => 'Имя настройки',
        'data_type' => 'Тип данных',
        'val' => 'Значение',
        'val_note' => 'В случае массива каждый элемент должен быть на новой строке. Для boolean: true или false.',
        'description' => 'Описание',
    ],
];
