<?php

return [
    'title' => 'Характеристики',
    'category_specs_link' => 'Редактировать характеристики категории ":category"',
    'is_filter' => 'Фильтр',
    'is_filter_note' => 'означает, что данная характеристика будет использована в фильтрах каталога.',
    'is_main' => 'Главная',
    'is_main_note' => 'означает, что данная характеристика будет использована в списке главных характеристик на странице товара рядом с изображением.',
    'used_in' => 'используется в :num SKU',
    'not_used' => 'не используется',

    'messages' => [
        'spec_updated' => 'Характеристика обновлена',
        'spec_cleared' => 'Характеристика очищена',
        'spec_added' => 'Характеристика добавлена',
        'spec_deleted' => 'Характеристика удалена',
    ],
];
